html/is1103.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-12-02 Sat 22:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jethro Kuan" />
</head>
<body>
<div id="content">

<div id="outline-container-org1558b09" class="outline-2">
<h2 id="org1558b09"><span class="section-number-2">1</span> Morality</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Directives that guide our conduct as individuals</li>
<li>Social policies framed at the macrolevel</li>
</ol>

<p>
Moral systems are evaluated against standards called <i>principles</i>.
Morality is:
</p>

<dl class="org-dl">
<dt>Public</dt><dd>Rules are public; Everyone is obligated to partake in a moral system</dd>
<dt>Informal</dt><dd>Has no formal authoritative judges presiding over it</dd>
<dt>Impartial</dt><dd>Moral rules are ideally designed to apply equitably to all participants</dd>
<dt>Rational</dt><dd>The system is based on principles of logical reason</dd>
</dl>
</div>
</div>
<div id="outline-container-org36271c4" class="outline-2">
<h2 id="org36271c4"><span class="section-number-2">2</span> Values</h2>
<div class="outline-text-2" id="text-2">
<dl class="org-dl">
<dt>Instrumental</dt><dd>Provide external benefit (eg. computers etc)</dd>
<dt>Intrinsic</dt><dd>Valued for their own sake (eg. life, happiness)</dd>
</dl>
</div>
</div>
<div id="outline-container-orgd62ac1f" class="outline-2">
<h2 id="orgd62ac1f"><span class="section-number-2">3</span> Ethical Theories</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org7ed0ec6" class="outline-3">
<h3 id="org7ed0ec6"><span class="section-number-3">3.1</span> Consequence-based (Utilitarianism)</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Some have argued that the primary goal of a moral system is to produce
desirable consequences or outcomes for its members. For these
ethicists, the consequences (i.e., the ends achieved) of actions and
policies provide the ultimate standard against which moral decisions
must be evaluated
</p>
</div>

<div id="outline-container-orgeee4ee2" class="outline-4">
<h4 id="orgeee4ee2"><span class="section-number-4">3.1.1</span> Utilitarianism</h4>
<div class="outline-text-4" id="text-3-1-1">
<blockquote>
<p>
An individual act (X) or a social policy (Y) is morally permissible if
the consequences that result from (X) or (Y) produce the greatest
amount of good for the greatest number of persons affected by the act
or policy.
</p>
</blockquote>

<ol class="org-ol">
<li>Social utility is superior to alternative criteria for evaluating
moral systems.</li>
<li>Social utility can be measured by the amount of happiness
produced.</li>
</ol>

<p>
Assumes:
</p>
<ol class="org-ol">
<li>All people desire happiness.</li>
<li>Happiness is an intrinsic good that is desired for its own sake.</li>
</ol>

<p>
<b>Act Utilitarianism:</b>
</p>

<blockquote>
<p>
An act, X, is morally permissible if the consequences produced by
doing X result in the greatest good for the greatest number of persons
affected by Act X.
</p>
</blockquote>

<p>
<b>Rule Utilitarianism:</b>
</p>

<blockquote>
<p>
An act, X, is morally permissible if the consequences of following the
general rule, Y, of which act X is an instance, would bring about the
greatest good for the greatest number.
</p>
</blockquote>

<p>
<b>Critic against Utilitarianism:</b>
</p>

<ol class="org-ol">
<li>Morality is basically tied to the production of happiness or pleasure.</li>
<li>Morality can ultimately be decided by consequences (of either acts
or policies).</li>
</ol>

<p>
Critics of utilitarianism argue that morality can be grounded neither
in consequences
</p>
</div>
</div>
</div>

<div id="outline-container-org6a21a11" class="outline-3">
<h3 id="org6a21a11"><span class="section-number-3">3.2</span> Duty-based (Deontology)</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Kant points out that, in some instances, performing our duties may
result in our being unhappy and may not necessarily lead to
consequences that are considered desirable.
</p>

<p>
Kant bases deontology on two premises:
</p>
<ol class="org-ol">
<li>Our nature as rational creatures
<ul class="org-ul">
<li>Rationality is what separates us from other kinds of creatures. If
our primary nature were to merely seek happiness or pleasure, we
would be indistinguishable from other creatures.</li>
<li>Rational nature reveals certain duties or obligations to each
other as "rational beings"</li>
</ul></li>
<li>Human beings are ends-in-themselves
<ul class="org-ul">
<li>A genuinely moral system would never permit some humans to be
treated as means to the ends of others</li>
<li>We have a duty to treat fellow humans as ends; each individual
has the same moral worth</li>
</ul></li>
</ol>

<p>
<b>Categorical Imperative</b>:
</p>

<blockquote>
<p>
Act always on that maxim or principle (or rule) that can be
universally binding, without exception, for all human beings.
</p>
</blockquote>

<p>
This forms a system of universality and impartiality. The objective
rule to be followed—that is, the litmus test for determining when an
action will have moral worth—is whether the act complies with the
categorical imperative, and whether it is universal and impartial.
</p>

<p>
<b>Act Deontology</b>:
</p>

<p>
Ross argues that when two or more moral duties
clash, we have to look at individual situations in order to determine
which duty will override another.
</p>

<p>
Ross believes that we have certain prima facie (or self-evident)
duties, which, all things being equal, we must follow. He provides a
list of prima facie duties such as honesty, benevolence, justice, and
so forth.
</p>

<ol class="org-ol">
<li>Reflect on the competing prima facie duties.</li>
<li>Weigh the evidence at hand to determine which course of action
would be required in a particular circumstance.</li>
</ol>
</div>
</div>

<div id="outline-container-org8d0de1a" class="outline-3">
<h3 id="org8d0de1a"><span class="section-number-3">3.3</span> Contract-based</h3>
<div class="outline-text-3" id="text-3-3">
<p>
In his classic work <i>Leviathan</i>, Hobbes describes an original
"premoral" state that he calls the "state of nature." It is premoral
because there are no moral (or legal) rules yet in existence. In this
state, each individual is free to act in ways that satisfy his or her
own natural desires. According to Hobbes, our natural (or physical)
constitution is such that in the state of nature we act in ways that
will enable us to satisfy our desires (or appetites) and to avoid what
Hobbes calls our "aversions."
</p>

<p>
Hobbes believes that we are willing to surrender some of our
"absolute" freedoms to a sovereign. In return, we receive many
benefits, including a system of rules and laws that are designed and
enforced to protect individuals from being harmed by other members of
the system.
</p>

<p>
We see that it is in our individual self-interest to develop a moral
system with rules.
</p>
</div>
