org/reference/is1103.org
*** Criticisms
Some critics, such as Pojman (2006), point out that contract-based
theories provide the foundation for only a minimalist morality. They
are minimalist in the sense that we are obligated to behave morally
only where an explicit or formal contract exists. So if I have no
express contract with you, or if a country such as the United States
has no explicit contract with a developing nation, there is no moral
obligation for me to help you or for the United States to come to the
aid of that developing nation.

** Rights-Based
- humans possess some natural rights
- Two kinds of legal rights: positive rights and negative rights.
  Having a negative right to something simply means that one has the
  right not to be interfered with in carrying out the privileges
  associated with that right.
- Positive rights more rare and harder to justify.

** Character-based
Because virtue ethics focuses primarily on character development and
moral education, it does not need to rely on a system of formal
rules.

Character-based ethical systems would most likely flourish in cultures
where the emphasis placed on community life is stronger than that
accorded to the role of individuals themselves.
#+attr_latex: :width \textwidth :align |X|X|X|
 | Type of Theory                  | Advantages                                         | Disadvantages                                                 |
 |---------------------------------+----------------------------------------------------+---------------------------------------------------------------|
 | Consequence-based (Utilitarian) | Stresses promotion of happiness and utility        | Ignores concerns of justice for the minority population       |
 | Duty-based (deontology)         | Stresses the role of duty and respect for persons  | Underestimates the importance of happiness and social utility |
 | Contract-based (rights)         | Provides a motivation for morality                 | Ofers only a minimal morality                                 |
 | Character-based (virtue)        | Stresses character development and moral education | Depends on homogeneous standards for morality                 |

** Moor's Just Consequentialist Framework
1. Deliberate over various policies from an impartial point of view to
   determine whether they meet the criteria for being ethical
   policies. A policy is ethical, if it
   - does not cause any unnecessary harms to individuals and groups,
     and
   - supports individual rights, the fulfilling of duties, etc.
2. Select the best policy from the set of just policies arrived at in
   the deliberation stage by ranking ethical policies in terms of
   benefits and (justifiable) harms. In doing this, be sure to:
   - weigh carefully between the good consequences and bad
     consequences in the ethical policies, and
   - distinguish between disagreements about facts and disagreements
     about principles and values, when deciding which particular
     ethical policy should be adopted. (Knowledge about the facts
     surrounding a particular case should inform the decision-making
     process.)

* Professional Ethics
Professionals are experts in a field, which provides them an advantage
over the lay person and that professional’s work has the potential to
impact—either positively or negatively—the general public at large.

Broadly speaking, a computer/IT professional is anyone employed in the
computing and IT fields—from software and hardware engineers, to
specialists such as support person- nel, network administrators, and
computer repair technicians.

As IT professionals we have significant opportunities to:

1. do good or cause harm,
2. enable others to do good or cause harm,
3. influence others to do good or cause harm.


- Moral Responsibility :: determined by looking at causality and
     intent. X is responsible for Y if X caused Y, regardless of
     intention of outcome, or regardless of the outcome of an
     intention.
- Legal Liability :: usually a legal concept, determines compensation
     for harmful consequences, rather than blame. May be legally
     liable, though not morally responsible
- Accountability :: Broader concept than liability that finds
                    answerable — to superiors, authorities, or public.
                    Helps because responsibility is hard to pinpoint
                    to individuals in large software developments.

** Whistleblowing
Morally permitted to blow the whistle:
1. The product will do "serious and considerable harm" to the public.
2. The engineer(s) have reported the "serious threat" to their
   immediate supervisor.
3. The engineer(s) have "exhausted the internal procedures and
   possibilities" within the company, including going to the board of
   directors, having received no support from their immediate
   supervisor.

To have a strict moral obligation to blow the whistle, De George
   believes that two additional conditions must be satisfied: 
1. The engineer(s) have "accessible, documented evidence that would
   convince a reasonable, impartial, observer that one’s view of the
   situation is correct."
2. The engineer(s) have "good reasons to believe that by going public
   the necessary changes will be brought about."

* Privacy
Consider the impact that changes involving this technology have had on
privacy with respect to the:

1. amount of personal information that can be collect,
2. speed at which personal information can be transmitted,
3. duration of time that the information can be retained,
4. kind of information that can be acquired and exchanged.

** Definitions
- Accessibility privacy :: Privacy is defined as one’s physically
     being let alone, or being free from intrusion into one’s physical
     space.
- Decisional privacy :: Privacy is defined as freedom from
     interference in one’s choices and decisions.
- Informational privacy :: Privacy is defined as control over the flow
     of one’s personal information, including the transfer and
     exchange of that information.

** Moor's Account of Privacy
#+begin_quote
An individual [has] privacy in a situation with regard to others if
and only if in that situation the individual [is] protected from
intrusion, interference, and information access by others.
#+end_quote

