html/is1103.html

<div id="outline-container-org09758d9" class="outline-4">
<h4 id="org09758d9"><span class="section-number-4">3.3.1</span> Criticisms</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
Some critics, such as Pojman (2006), point out that contract-based
theories provide the foundation for only a minimalist morality. They
are minimalist in the sense that we are obligated to behave morally
only where an explicit or formal contract exists. So if I have no
express contract with you, or if a country such as the United States
has no explicit contract with a developing nation, there is no moral
obligation for me to help you or for the United States to come to the
aid of that developing nation.
</p>
</div>
</div>
</div>

<div id="outline-container-org9853b55" class="outline-3">
<h3 id="org9853b55"><span class="section-number-3">3.4</span> Rights-Based</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li>humans possess some natural rights</li>
<li>Two kinds of legal rights: positive rights and negative rights.
Having a negative right to something simply means that one has the
right not to be interfered with in carrying out the privileges
associated with that right.</li>
<li>Positive rights more rare and harder to justify.</li>
</ul>
</div>
</div>

<div id="outline-container-orge322341" class="outline-3">
<h3 id="orge322341"><span class="section-number-3">3.5</span> Character-based</h3>
<div class="outline-text-3" id="text-3-5">
<p>
Because virtue ethics focuses primarily on character development and
moral education, it does not need to rely on a system of formal
rules.
</p>

<p>
Character-based ethical systems would most likely flourish in cultures
where the emphasis placed on community life is stronger than that
accorded to the role of individuals themselves.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Type of Theory</th>
<th scope="col" class="org-left">Advantages</th>
<th scope="col" class="org-left">Disadvantages</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Consequence-based (Utilitarian)</td>
<td class="org-left">Stresses promotion of happiness and utility</td>
<td class="org-left">Ignores concerns of justice for the minority population</td>
</tr>

<tr>
<td class="org-left">Duty-based (deontology)</td>
<td class="org-left">Stresses the role of duty and respect for persons</td>
<td class="org-left">Underestimates the importance of happiness and social utility</td>
</tr>

<tr>
<td class="org-left">Contract-based (rights)</td>
<td class="org-left">Provides a motivation for morality</td>
<td class="org-left">Ofers only a minimal morality</td>
</tr>

<tr>
<td class="org-left">Character-based (virtue)</td>
<td class="org-left">Stresses character development and moral education</td>
<td class="org-left">Depends on homogeneous standards for morality</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgb2cd819" class="outline-3">
<h3 id="orgb2cd819"><span class="section-number-3">3.6</span> Moor's Just Consequentialist Framework</h3>
<div class="outline-text-3" id="text-3-6">
<ol class="org-ol">
<li>Deliberate over various policies from an impartial point of view to
determine whether they meet the criteria for being ethical
policies. A policy is ethical, if it
<ul class="org-ul">
<li>does not cause any unnecessary harms to individuals and groups,
and</li>
<li>supports individual rights, the fulfilling of duties, etc.</li>
</ul></li>
<li>Select the best policy from the set of just policies arrived at in
the deliberation stage by ranking ethical policies in terms of
benefits and (justifiable) harms. In doing this, be sure to:
<ul class="org-ul">
<li>weigh carefully between the good consequences and bad
consequences in the ethical policies, and</li>
<li>distinguish between disagreements about facts and disagreements
about principles and values, when deciding which particular
ethical policy should be adopted. (Knowledge about the facts
surrounding a particular case should inform the decision-making
process.)</li>
</ul></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org2170525" class="outline-2">
<h2 id="org2170525"><span class="section-number-2">4</span> Professional Ethics</h2>
<div class="outline-text-2" id="text-4">
<p>
Professionals are experts in a field, which provides them an advantage
over the lay person and that professional’s work has the potential to
impact—either positively or negatively—the general public at large.
</p>

<p>
Broadly speaking, a computer/IT professional is anyone employed in the
computing and IT fields—from software and hardware engineers, to
specialists such as support person- nel, network administrators, and
computer repair technicians.
</p>

<p>
As IT professionals we have significant opportunities to:
</p>

<ol class="org-ol">
<li>do good or cause harm,</li>
<li>enable others to do good or cause harm,</li>
<li>influence others to do good or cause harm.</li>
</ol>


<dl class="org-dl">
<dt>Moral Responsibility</dt><dd>determined by looking at causality and
intent. X is responsible for Y if X caused Y, regardless of
intention of outcome, or regardless of the outcome of an
intention.</dd>
<dt>Legal Liability</dt><dd>usually a legal concept, determines compensation
for harmful consequences, rather than blame. May be legally
liable, though not morally responsible</dd>
<dt>Accountability</dt><dd>Broader concept than liability that finds
answerable — to superiors, authorities, or public.
Helps because responsibility is hard to pinpoint
to individuals in large software developments.</dd>
</dl>
</div>

<div id="outline-container-orgd86b3c3" class="outline-3">
<h3 id="orgd86b3c3"><span class="section-number-3">4.1</span> Whistleblowing</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Morally permitted to blow the whistle:
</p>
<ol class="org-ol">
<li>The product will do "serious and considerable harm" to the public.</li>
<li>The engineer(s) have reported the "serious threat" to their
immediate supervisor.</li>
<li>The engineer(s) have "exhausted the internal procedures and
possibilities" within the company, including going to the board of
directors, having received no support from their immediate
supervisor.</li>
</ol>

<p>
To have a strict moral obligation to blow the whistle, De George
   believes that two additional conditions must be satisfied: 
</p>
<ol class="org-ol">
<li>The engineer(s) have "accessible, documented evidence that would
convince a reasonable, impartial, observer that one’s view of the
situation is correct."</li>
<li>The engineer(s) have "good reasons to believe that by going public
the necessary changes will be brought about."</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org50b2e9f" class="outline-2">
<h2 id="org50b2e9f"><span class="section-number-2">5</span> Privacy</h2>
<div class="outline-text-2" id="text-5">
<p>
Consider the impact that changes involving this technology have had on
privacy with respect to the:
</p>

<ol class="org-ol">
<li>amount of personal information that can be collect,</li>
<li>speed at which personal information can be transmitted,</li>
<li>duration of time that the information can be retained,</li>
<li>kind of information that can be acquired and exchanged.</li>
</ol>
</div>

<div id="outline-container-orgd549371" class="outline-3">
<h3 id="orgd549371"><span class="section-number-3">5.1</span> Definitions</h3>
<div class="outline-text-3" id="text-5-1">
<dl class="org-dl">
<dt>Accessibility privacy</dt><dd>Privacy is defined as one’s physically
being let alone, or being free from intrusion into one’s physical
space.</dd>
<dt>Decisional privacy</dt><dd>Privacy is defined as freedom from
interference in one’s choices and decisions.</dd>
<dt>Informational privacy</dt><dd>Privacy is defined as control over the flow
of one’s personal information, including the transfer and
exchange of that information.</dd>
</dl>
</div>
</div>

<div id="outline-container-org0131926" class="outline-3">
<h3 id="org0131926"><span class="section-number-3">5.2</span> Moor's Account of Privacy</h3>
<div class="outline-text-3" id="text-5-2">
<blockquote>
<p>
An individual [has] privacy in a situation with regard to others if
and only if in that situation the individual [is] protected from
intrusion, interference, and information access by others.
</p>
</blockquote>
</div>
