org/reference/is1103.org
*** Naturally private vs normatively private
In a naturally private situation, individuals are protected from
access and interference from others by natural means, for example,
physical boundaries such as those one enjoys while hiking alone in the
woods. In this case, privacy can be lost but not violated, because
there are no norms—conventional, legal, or ethical—according to which
one has a right, or even an expectation, to be protected. In a
normatively private situation, on the other hand, individuals are
protected by conventional norms (e.g., formal laws and informal
policies) because they involve certain kinds of zones or contexts that
we have determined to need normative protection.

** Contextual Integrity
Nissenbaum’s privacy framework requires that the processes used in
gathering and disseminating information (a) are "appropriate to a
particular context" and (b) comply with norms that govern the flow of
personal information in a given context. She refers to these two types
of informational norms as follows:

1. Norms of appropriateness.
2. Norms of distribution.

Whereas norms of appropriateness determine whether a given type of
personal information is either appropriate or inappropriate to divulge
within a particular context, norms of distribution restrict or limit
the flow of information within and across contexts. When either norm
has been "breached," a violation of privacy occurs; conversely, the
contextual integrity of the flow of personal information is maintained
when both kinds of norms are "respected."

** The Value of Privacy
Fried suggests that unlike most instrumental values that are simply
one means among others for achieving a desired end, privacy is also
essential, that is, necessary to achieve some important human ends,
such as trust and friendship. We tend to associate intrinsic values
with necessary conditions and instrumental values with contingent, or
nonnecessary conditions; so while privacy is instrumental in that it
is a means to certain human ends, Fried argues that it is also a
necessary condition for achieving those ends.

Moor believes that privacy is an articulation, or "expression" of the
"core value" security, which in turn is essential across cultures, for
human flourishing.

Based on the insights of DeCew and others, one might infer that
privacy is a value that simply benefits individuals. However, some
authors have pointed out the social value that privacy also provides,
noting that privacy is essential for democracy.

* Security
  #+attr_latex: :width \textwidth :align |c|X|
| Type    | What                                                                                    |
|---------+-----------------------------------------------------------------------------------------|
| Data    | Securing data that resides in computer databases; transmitted between computer systems  |
| System  | Securing hardware and operating system resources; application software and programs     |
| Network | Securing the infrastructure of privately owned networks; infrastructure of the Internet |

- Data security :: Concerned with vulnerabilities pertaining to
                   unauthorized access to data, as well as with
                   threats to the confidentiality, integrity, and
                   availability of data that resides in computer
                   storage devices or is exchanged between computer
                   systems. Data can either be sensitive, or proprietary,
                   or both. 
   - Confidentiality :: Preventing unauthorized persons from gaining
                        access to unauthorized information
   - Integrity :: Preventing an attacker from modifying data.
   - Accessibility :: Making sure that resources are available for
                      authorized users.
- System security :: Concerned with attacks on system resources (such
     as computer hardware, operating system software, and application
     software) by malicious programs.
- Network security :: Concerned with attacks on computer networks,
     including the infrastructure of privately owned networks as well
     as the Internet itself.
     
** Difference between privacy and security 
- Privacy :: Personal info accessed by organisations claiming to have legitimate need 
- Security :: Obtaining of information by unauthorised personnel
- Privacy can obscure the identity of security violaters

     


** Cloud Computing
#+begin_quote
a model for enabling ubiquitous, convenient, on-demand network access
to a shared pool of configurable computing resources (e.g., networks,
servers, storage, applications and services).
#+end_quote

*** Major Concerns
 1. How users can control their data stored in the cloud—currently,
    users have very little "control over or direct knowledge about how
    their information is transmitted, processed, or stored".
 2. Integrity of the data —- for example, if the host company goes out
    of business, what happens to the users’ data?
 3. Access to the data; i.e., can the host deny a user access to
    his/her own data?
 4. And a fourth concern has to do with who actually "owns" the data
    that is stored in the cloud

** Hacking and Hacker Ethic
According to Simpson (2006), a hacker is anyone who "accesses a
computer system or network without authorization from the owner."

Steven Levy (2001)
1. Access to computers should be unlimited and total.
2. All information should be free.
3. Mistrust authority–promote decentralization.
4. Hackers should be judged by their hacking (not by bogus criteria
   such as degrees, age, race, or position).
5. You can create art and beauty on a computer.
6. Computers can change your life for the better.

** Cyberterrorism
Dorothy Denning (2004) defines it as the “convergence of terrorism and
cyberspace.” As such, cyberterrorism covers politically motivated
hacking operations intended to cause grave harm—that is, resulting in
either loss of life or severe economic loss, or both.

