html/is1103.html

<div id="outline-container-org02edb8b" class="outline-4">
<h4 id="org02edb8b"><span class="section-number-4">5.2.1</span> Naturally private vs normatively private</h4>
<div class="outline-text-4" id="text-5-2-1">
<p>
In a naturally private situation, individuals are protected from
access and interference from others by natural means, for example,
physical boundaries such as those one enjoys while hiking alone in the
woods. In this case, privacy can be lost but not violated, because
there are no norms—conventional, legal, or ethical—according to which
one has a right, or even an expectation, to be protected. In a
normatively private situation, on the other hand, individuals are
protected by conventional norms (e.g., formal laws and informal
policies) because they involve certain kinds of zones or contexts that
we have determined to need normative protection.
</p>
</div>
</div>
</div>

<div id="outline-container-org5969d65" class="outline-3">
<h3 id="org5969d65"><span class="section-number-3">5.3</span> Contextual Integrity</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Nissenbaum’s privacy framework requires that the processes used in
gathering and disseminating information (a) are "appropriate to a
particular context" and (b) comply with norms that govern the flow of
personal information in a given context. She refers to these two types
of informational norms as follows:
</p>

<ol class="org-ol">
<li>Norms of appropriateness.</li>
<li>Norms of distribution.</li>
</ol>

<p>
Whereas norms of appropriateness determine whether a given type of
personal information is either appropriate or inappropriate to divulge
within a particular context, norms of distribution restrict or limit
the flow of information within and across contexts. When either norm
has been "breached," a violation of privacy occurs; conversely, the
contextual integrity of the flow of personal information is maintained
when both kinds of norms are "respected."
</p>
</div>
</div>

<div id="outline-container-orge83cfef" class="outline-3">
<h3 id="orge83cfef"><span class="section-number-3">5.4</span> The Value of Privacy</h3>
<div class="outline-text-3" id="text-5-4">
<p>
Fried suggests that unlike most instrumental values that are simply
one means among others for achieving a desired end, privacy is also
essential, that is, necessary to achieve some important human ends,
such as trust and friendship. We tend to associate intrinsic values
with necessary conditions and instrumental values with contingent, or
nonnecessary conditions; so while privacy is instrumental in that it
is a means to certain human ends, Fried argues that it is also a
necessary condition for achieving those ends.
</p>

<p>
Moor believes that privacy is an articulation, or "expression" of the
"core value" security, which in turn is essential across cultures, for
human flourishing.
</p>

<p>
Based on the insights of DeCew and others, one might infer that
privacy is a value that simply benefits individuals. However, some
authors have pointed out the social value that privacy also provides,
noting that privacy is essential for democracy.
</p>
</div>
</div>
</div>

<div id="outline-container-orgfc55bba" class="outline-2">
<h2 id="orgfc55bba"><span class="section-number-2">6</span> Security</h2>
<div class="outline-text-2" id="text-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">What</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Data</td>
<td class="org-left">Securing data that resides in computer databases; transmitted between computer systems</td>
</tr>

<tr>
<td class="org-left">System</td>
<td class="org-left">Securing hardware and operating system resources; application software and programs</td>
</tr>

<tr>
<td class="org-left">Network</td>
<td class="org-left">Securing the infrastructure of privately owned networks; infrastructure of the Internet</td>
</tr>
</tbody>
</table>

<dl class="org-dl">
<dt>Data security</dt><dd>Concerned with vulnerabilities pertaining to
unauthorized access to data, as well as with
threats to the confidentiality, integrity, and
availability of data that resides in computer
storage devices or is exchanged between computer
systems. Data can either be sensitive, or proprietary,
or both. 
<dl class="org-dl">
<dt>Confidentiality</dt><dd>Preventing unauthorized persons from gaining
access to unauthorized information</dd>
<dt>Integrity</dt><dd>Preventing an attacker from modifying data.</dd>
<dt>Accessibility</dt><dd>Making sure that resources are available for
authorized users.</dd>
</dl></dd>
<dt>System security</dt><dd>Concerned with attacks on system resources (such
as computer hardware, operating system software, and application
software) by malicious programs.</dd>
<dt>Network security</dt><dd>Concerned with attacks on computer networks,
including the infrastructure of privately owned networks as well
as the Internet itself.</dd>
</dl>
</div>

<div id="outline-container-org88f7e1e" class="outline-3">
<h3 id="org88f7e1e"><span class="section-number-3">6.1</span> Difference between privacy and security</h3>
<div class="outline-text-3" id="text-6-1">
<dl class="org-dl">
<dt>Privacy</dt><dd>Personal info accessed by organisations claiming to have legitimate need</dd>
<dt>Security</dt><dd>Obtaining of information by unauthorised personnel</dd>
<dt>(no term)</dt><dd>Privacy can obscure the identity of security violaters</dd>
</dl>
</div>
</div>




<div id="outline-container-org33b09d7" class="outline-3">
<h3 id="org33b09d7"><span class="section-number-3">6.2</span> Cloud Computing</h3>
<div class="outline-text-3" id="text-6-2">
<blockquote>
<p>
a model for enabling ubiquitous, convenient, on-demand network access
to a shared pool of configurable computing resources (e.g., networks,
servers, storage, applications and services).
</p>
</blockquote>
</div>

<div id="outline-container-orgce34613" class="outline-4">
<h4 id="orgce34613"><span class="section-number-4">6.2.1</span> Major Concerns</h4>
<div class="outline-text-4" id="text-6-2-1">
<ol class="org-ol">
<li>How users can control their data stored in the cloud—currently,
users have very little "control over or direct knowledge about how
their information is transmitted, processed, or stored".</li>
<li>Integrity of the data —- for example, if the host company goes out
of business, what happens to the users’ data?</li>
<li>Access to the data; i.e., can the host deny a user access to
his/her own data?</li>
<li>And a fourth concern has to do with who actually "owns" the data
that is stored in the cloud</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org0e2e19a" class="outline-3">
<h3 id="org0e2e19a"><span class="section-number-3">6.3</span> Hacking and Hacker Ethic</h3>
<div class="outline-text-3" id="text-6-3">
<p>
According to Simpson (2006), a hacker is anyone who "accesses a
computer system or network without authorization from the owner."
</p>

<p>
Steven Levy (2001)
</p>
<ol class="org-ol">
<li>Access to computers should be unlimited and total.</li>
<li>All information should be free.</li>
<li>Mistrust authority–promote decentralization.</li>
<li>Hackers should be judged by their hacking (not by bogus criteria
such as degrees, age, race, or position).</li>
<li>You can create art and beauty on a computer.</li>
<li>Computers can change your life for the better.</li>
</ol>
</div>
</div>

<div id="outline-container-orga71f909" class="outline-3">
<h3 id="orga71f909"><span class="section-number-3">6.4</span> Cyberterrorism</h3>
<div class="outline-text-3" id="text-6-4">
<p>
Dorothy Denning (2004) defines it as the “convergence of terrorism and
cyberspace.” As such, cyberterrorism covers politically motivated
hacking operations intended to cause grave harm—that is, resulting in
either loss of life or severe economic loss, or both.
</p>
</div>
</div>
