org/reference/is1103.org
** Hacktivism
"Electronic Civil Disobedience" (ECD). Criteria for CD:

1. No damage done to persons or property. (Debatable, depending on context)
2. Nonviolent.
3. Not for personal profit.
4. Ethical motivation—the strong conviction that a law is unjust, or
   unfair, to the extreme detriment of the common good.
5. Willingness to accept personal responsibility for the outcome of
   actions.


- Hacktivism :: The convergence of political activism and computer
                hacking techniques to engage in a new form of civil
                disobedience. 
- Cyberterrorism :: The convergence of cybertechnology and terrorism
                    for carrying out acts of terror in (or via)
                    cyberspace.
- Information Warfare :: Using malware in cyberattacks designed to
     mislead the enemy and disrupt/damage an opponent’s military 
     defense system and its critical infrastructure.

* Cybercrime
By thinking about cybercrimes in terms of their unique or special
features—i.e., conditions that separate them from ordinary crimes—we
could distinguish authentic or “genuine” cybercrimes from other crimes
that merely involve the use or the presence of cybertechnology. We
propose a definition of a genuine cybercrime as a crime in which

#+begin_quote
the criminal act can be carried out only through the use of
cybertechnology and can take place only in the cyberrealm.
#+end_quote

- Cyberpiracy :: using cybertechnology in unauthorized ways to (a)
                 reproduce copies of proprietary information, or (b)
                 distribute proprietary information (in digital form)
                 across a computer network.
- Cybertrespass :: using cybertechnology to gain unauthorized access
                   to (a) an individual’s or an organization’s
                   computer system, or (b) a password-protected Web
                   site.
- Cybervandalism :: using cybertechnology to unleash one or more
                    programs that (a) disrupt the transmission of
                    electronic information across one or more computer
                    networks, including the Internet, or (b) destroy
                    data resident in a computer or damage a computer
                    system’s resources, or both.
                    
** Pre-emptive hacking

#+begin_quote
The goal of the ethical hacker is to help the organization take
preemptive measures against malicious attacks by attacking the system
himself; all the while staying within legal limits ... an Ethical
Hacker is very similar to a Penetration Tester ... When it is done
by request and under a contract between an Ethical Hacker and an
organization, it is legal.
#+end_quote

- Justified through utilitarian/consequentialist means :: Less harm
     overall, society gain benefits from a more robust system
- Not justified as innocent individuals are used as means to an end :: The
     systems of innocent users are used for pre- emptive hacking as
     'host computers', which is morally unjustifiable under
     deontological theory, as nobody should be used as an means to an
     end

** Cyber-assisted crimes
- Cyberexacerbated :: Cyberstalking; Internet pedophilia; Internet
     pornography
- Cyberassisted :: Online tax fraud; Physical assault with a computer
                    (e.g., hitting someone over the head with a
                    computer monitor); Property damage using a
                    computer hardware device (e.g., throwing a CPU
                    through a window)

** Identity Theft
Cyberexcerbated; a crime in which an imposter obtains key pieces of
personal information, such as social security or driver’s license
numbers, in order to impersonate someone else. The information can be
used to obtain credit, merchandise, and services in the name of the
victim, or to provide the thief with false credentials.

** Vigilante
Definition: a civilian or organization acting in a law enforcement
capacity (or in the pursuit of self-perceived justice) without legal
authority.

- Vigilantism – reaction (often punishment) to real/perceived
  deviance.
- Involves planning and premeditation by those engaging in it
- Its participants are private citizens whose engagement is voluntary
- Form of autonomous citizenship that constitutes a social movement
- Uses or threatens the use of force
- Arises when established order is under threat from the
  transgression, potential transgression or imputed transgression of
  institutionalized norms
- Aims to control crime or other social infractions by offering
  reassurances (or ‘guarantees’) of security both to the participants
  and to others.

Internet technology facilitates the following:
- Allows the average person to play the role of the report/journalist
  to chronicle objectionable act (i.e. become reporters)
- Allows the average person to read/watch the footage of the act and
  take active actions in response (i.e. become vigilantes)
- Footage of the act could be easily circulated to a global audience
- Easier for the poster and the reader to remain anonymous
- Harder for the offenders to “erase” their label. The stigma may be
  permanent.

* Big Data
** Paradoxes
*** Transparency
Big data promises to use this data to make the world more transparent,
but its collection is invisible, and its tools and techniques are
opaque, shrouded by layers of physical, legal, and technical privacy
by design. If big data spells the end of privacy, then why is the big
data revolution occurring mostly in secret?
*** Identity
Big data seeks to identify, but it also threatens identity. This is
the Identity Paradox. We instinctively desire sovereignty over our
personal identity. Whereas the important right to privacy harkens from
the right to be left alone, the right to identity originates from
the right to free choice about who we are.

If we lack the power to individually say who “I am,” if filters and
nudges and personalized recommendations undermine our intellectual
choices, we will have become identified but lose our identities as we
have defined and cherished them in the past.
*** Power
Big data will create winners and losers, and it is likely to benefit
the institutions who wield its tools over the individuals being mined,
analyzed, and sorted. Not knowing the appropriate legal or technical
boundaries, each side is left guessing. Individuals succumb to denial
while governments and corporations get away with what they can by
default, until they are left reeling from scandal after shock of
disclosure. The result is an uneasy, uncertain state of affairs that
is not healthy for anyone and leaves individual rights eroded and our
democracy diminished.
