html/is1103.html

<div id="outline-container-org1db42c0" class="outline-3">
<h3 id="org1db42c0"><span class="section-number-3">6.5</span> Hacktivism</h3>
<div class="outline-text-3" id="text-6-5">
<p>
"Electronic Civil Disobedience" (ECD). Criteria for CD:
</p>

<ol class="org-ol">
<li>No damage done to persons or property. (Debatable, depending on context)</li>
<li>Nonviolent.</li>
<li>Not for personal profit.</li>
<li>Ethical motivation—the strong conviction that a law is unjust, or
unfair, to the extreme detriment of the common good.</li>
<li>Willingness to accept personal responsibility for the outcome of
actions.</li>
</ol>


<dl class="org-dl">
<dt>Hacktivism</dt><dd>The convergence of political activism and computer
hacking techniques to engage in a new form of civil
disobedience.</dd>
<dt>Cyberterrorism</dt><dd>The convergence of cybertechnology and terrorism
for carrying out acts of terror in (or via)
cyberspace.</dd>
<dt>Information Warfare</dt><dd>Using malware in cyberattacks designed to
mislead the enemy and disrupt/damage an opponent’s military 
defense system and its critical infrastructure.</dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-org469e2ac" class="outline-2">
<h2 id="org469e2ac"><span class="section-number-2">7</span> Cybercrime</h2>
<div class="outline-text-2" id="text-7">
<p>
By thinking about cybercrimes in terms of their unique or special
features—i.e., conditions that separate them from ordinary crimes—we
could distinguish authentic or “genuine” cybercrimes from other crimes
that merely involve the use or the presence of cybertechnology. We
propose a definition of a genuine cybercrime as a crime in which
</p>

<blockquote>
<p>
the criminal act can be carried out only through the use of
cybertechnology and can take place only in the cyberrealm.
</p>
</blockquote>

<dl class="org-dl">
<dt>Cyberpiracy</dt><dd>using cybertechnology in unauthorized ways to (a)
reproduce copies of proprietary information, or (b)
distribute proprietary information (in digital form)
across a computer network.</dd>
<dt>Cybertrespass</dt><dd>using cybertechnology to gain unauthorized access
to (a) an individual’s or an organization’s
computer system, or (b) a password-protected Web
site.</dd>
<dt>Cybervandalism</dt><dd>using cybertechnology to unleash one or more
programs that (a) disrupt the transmission of
electronic information across one or more computer
networks, including the Internet, or (b) destroy
data resident in a computer or damage a computer
system’s resources, or both.</dd>
</dl>
</div>

<div id="outline-container-org2d3a81f" class="outline-3">
<h3 id="org2d3a81f"><span class="section-number-3">7.1</span> Pre-emptive hacking</h3>
<div class="outline-text-3" id="text-7-1">
<blockquote>
<p>
The goal of the ethical hacker is to help the organization take
preemptive measures against malicious attacks by attacking the system
himself; all the while staying within legal limits &#x2026; an Ethical
Hacker is very similar to a Penetration Tester &#x2026; When it is done
by request and under a contract between an Ethical Hacker and an
organization, it is legal.
</p>
</blockquote>

<dl class="org-dl">
<dt>Justified through utilitarian/consequentialist means</dt><dd>Less harm
overall, society gain benefits from a more robust system</dd>
<dt>Not justified as innocent individuals are used as means to an end</dt><dd>The
systems of innocent users are used for pre- emptive hacking as
'host computers', which is morally unjustifiable under
deontological theory, as nobody should be used as an means to an
end</dd>
</dl>
</div>
</div>

<div id="outline-container-org16887ff" class="outline-3">
<h3 id="org16887ff"><span class="section-number-3">7.2</span> Cyber-assisted crimes</h3>
<div class="outline-text-3" id="text-7-2">
<dl class="org-dl">
<dt>Cyberexacerbated</dt><dd>Cyberstalking; Internet pedophilia; Internet
pornography</dd>
<dt>Cyberassisted</dt><dd>Online tax fraud; Physical assault with a computer
(e.g., hitting someone over the head with a
computer monitor); Property damage using a
computer hardware device (e.g., throwing a CPU
through a window)</dd>
</dl>
</div>
</div>

<div id="outline-container-orgd74a26c" class="outline-3">
<h3 id="orgd74a26c"><span class="section-number-3">7.3</span> Identity Theft</h3>
<div class="outline-text-3" id="text-7-3">
<p>
Cyberexcerbated; a crime in which an imposter obtains key pieces of
personal information, such as social security or driver’s license
numbers, in order to impersonate someone else. The information can be
used to obtain credit, merchandise, and services in the name of the
victim, or to provide the thief with false credentials.
</p>
</div>
</div>

<div id="outline-container-org3560e0f" class="outline-3">
<h3 id="org3560e0f"><span class="section-number-3">7.4</span> Vigilante</h3>
<div class="outline-text-3" id="text-7-4">
<p>
Definition: a civilian or organization acting in a law enforcement
capacity (or in the pursuit of self-perceived justice) without legal
authority.
</p>

<ul class="org-ul">
<li>Vigilantism – reaction (often punishment) to real/perceived
deviance.</li>
<li>Involves planning and premeditation by those engaging in it</li>
<li>Its participants are private citizens whose engagement is voluntary</li>
<li>Form of autonomous citizenship that constitutes a social movement</li>
<li>Uses or threatens the use of force</li>
<li>Arises when established order is under threat from the
transgression, potential transgression or imputed transgression of
institutionalized norms</li>
<li>Aims to control crime or other social infractions by offering
reassurances (or ‘guarantees’) of security both to the participants
and to others.</li>
</ul>

<p>
Internet technology facilitates the following:
</p>
<ul class="org-ul">
<li>Allows the average person to play the role of the report/journalist
to chronicle objectionable act (i.e. become reporters)</li>
<li>Allows the average person to read/watch the footage of the act and
take active actions in response (i.e. become vigilantes)</li>
<li>Footage of the act could be easily circulated to a global audience</li>
<li>Easier for the poster and the reader to remain anonymous</li>
<li>Harder for the offenders to “erase” their label. The stigma may be
permanent.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgb6cd24c" class="outline-2">
<h2 id="orgb6cd24c"><span class="section-number-2">8</span> Big Data</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org424df55" class="outline-3">
<h3 id="org424df55"><span class="section-number-3">8.1</span> Paradoxes</h3>
<div class="outline-text-3" id="text-8-1">
</div>
<div id="outline-container-org84afd51" class="outline-4">
<h4 id="org84afd51"><span class="section-number-4">8.1.1</span> Transparency</h4>
<div class="outline-text-4" id="text-8-1-1">
<p>
Big data promises to use this data to make the world more transparent,
but its collection is invisible, and its tools and techniques are
opaque, shrouded by layers of physical, legal, and technical privacy
by design. If big data spells the end of privacy, then why is the big
data revolution occurring mostly in secret?
</p>
</div>
</div>
<div id="outline-container-org03ae781" class="outline-4">
<h4 id="org03ae781"><span class="section-number-4">8.1.2</span> Identity</h4>
<div class="outline-text-4" id="text-8-1-2">
<p>
Big data seeks to identify, but it also threatens identity. This is
the Identity Paradox. We instinctively desire sovereignty over our
personal identity. Whereas the important right to privacy harkens from
the right to be left alone, the right to identity originates from
the right to free choice about who we are.
</p>

<p>
If we lack the power to individually say who “I am,” if filters and
nudges and personalized recommendations undermine our intellectual
choices, we will have become identified but lose our identities as we
have defined and cherished them in the past.
</p>
</div>
</div>
<div id="outline-container-org1aa66b8" class="outline-4">
<h4 id="org1aa66b8"><span class="section-number-4">8.1.3</span> Power</h4>
<div class="outline-text-4" id="text-8-1-3">
<p>
Big data will create winners and losers, and it is likely to benefit
the institutions who wield its tools over the individuals being mined,
analyzed, and sorted. Not knowing the appropriate legal or technical
boundaries, each side is left guessing. Individuals succumb to denial
while governments and corporations get away with what they can by
default, until they are left reeling from scandal after shock of
disclosure. The result is an uneasy, uncertain state of affairs that
is not healthy for anyone and leaves individual rights eroded and our
democracy diminished.
</p>
</div>
</div>
</div>
