html/is1103.html
<div id="outline-container-orgabc59eb" class="outline-3">
<h3 id="orgabc59eb"><span class="section-number-3">8.2</span> Privacy</h3>
<div class="outline-text-3" id="text-8-2">
<ul class="org-ul">
<li>Companies and governments increase use of big data to improve
products and services, including defending against terrorist and
cybersecurity attacks</li>
<li>Public increases questions about privacy and how data is used as
realisation of invasions is brought to awareness</li>
</ul>

<p>
Privacy needs new focus. Instead of focusing on the collection of 
information, our new focus should be on the rules that govern 
how personal information is used and disclosed 
</p>

<ul class="org-ul">
<li>The rules that govern how information flows and not merely
restrictions on acquiring personal information or data (Nissenbaum)</li>
<li>But our practical ability to manage the trade of personal
information needs to be fixed. How can we self-manage privacy?
<ul class="org-ul">
<li>notice: data processors should disclose what they are doing with
personal data</li>
<li>choice: people should be able to opt-out of uses of their data
that they dislike</li>
</ul></li>
<li>But is self-management a feasible route?</li>
</ul>
</div>
</div>
<div id="outline-container-org166be15" class="outline-3">
<h3 id="org166be15"><span class="section-number-3">8.3</span> Confidentiality</h3>
<div class="outline-text-3" id="text-8-3">
<p>
Information exists in states between being completely private and
completely public. 
</p>

<ul class="org-ul">
<li>Privacy is not binary. Important to recognise that.</li>
<li>Before big data, individuals could more easily gauge the expected
uses of their personal data and weigh the benefits and the costs at
the time they provided their consent.</li>
<li>For companies, the potential for harm due to unintended
consequences, can quickly outweigh the value the big data innovation
is intended to provide. Not limited to harm to individuals, but also
institutions.</li>
<li>Big data uses secondary information shared privately in confidence.
Can we trust this information to remain confidential? How can it be
regulated by law?</li>
</ul>
</div>
</div>

<div id="outline-container-orge3ac5f7" class="outline-3">
<h3 id="orge3ac5f7"><span class="section-number-3">8.4</span> Transparency</h3>
<div class="outline-text-3" id="text-8-4">
<p>
The power of big data comes in large part from secondary uses of data
sets to produce new predictions and inferences. Institutions like data
brokers, often without our knowledge or consent, are collecting
massive amounts of data about us they can use and share in secondary
ways that we do not want or expect.
</p>

<ul class="org-ul">
<li>Why is there privacy for institutions but none for individuals? How
can this be better balanced? Those who collect, share, and use data
must be made more transparent and thus more accountable.</li>
</ul>
</div>
</div>

<div id="outline-container-org5067cc3" class="outline-3">
<h3 id="org5067cc3"><span class="section-number-3">8.5</span> Changes</h3>
<div class="outline-text-3" id="text-8-5">
<p>
Changes in law are essential but insufficient, usually slow. So how 
do we fill this gap?
</p>

<ul class="org-ul">
<li>Chief Privacy Officers</li>
<li>In-house philosophers (eg. Damon Horowitz at Google)</li>
<li>Users (but requires institutions to be transparent)</li>
<li>Technologists can fill these gaps by rebutting “privacy is dead”
beliefs and moving to advance ethics of data, and creating new
business models, practices and technologies</li>
<li>Review boards (IRBs) for consumer experiments</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgf33f804" class="outline-2">
<h2 id="orgf33f804"><span class="section-number-2">9</span> Intellectual Property</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org6f7a5fd" class="outline-3">
<h3 id="org6f7a5fd"><span class="section-number-3">9.1</span> Copyright</h3>
<div class="outline-text-3" id="text-9-1">
<p>
Copyright is a form of protection provided to the authors of “original
works of authorship” including literary, dramatic, musical, artistic,
and certain other intellectual works, both published and unpublished.
The 1976 Copyright Act generally gives the owner of copyright the
exclusive right to reproduce the copyrighted work, to prepare
derivative works, to distribute copies or phonorecords of the
copyrighted work, to perform the copyrighted work publicly, or to
display the copyrighted work publicly.
</p>

<p>
The copyright protects the form of expression rather than the subject
matter of the writing. For example, a description of a machine could
be copyrighted, but this would only prevent others from copying the
description; it would not prevent others from writing a description of
their own or from making and using the machine. Copyrights are
registered by the Copyright Office of the Library of Congress.
</p>
</div>
</div>
<div id="outline-container-orga4a5446" class="outline-3">
<h3 id="orga4a5446"><span class="section-number-3">9.2</span> Trademark</h3>
<div class="outline-text-3" id="text-9-2">
<p>
A trademark is a word, name, symbol or device which is used in trade
with goods to indicate the source of the goods and to distinguish them
from the goods of others. A servicemark is the same as a trademark
except that it identifies and distinguishes the source of a service
rather than a product. The terms “trademark” and “mark” are commonly
used to refer to both trademarks and servicemarks.
</p>

<p>
Trademark rights may be used to prevent others from using a
confusingly similar mark, but not to prevent others from making the
same goods or from selling the same goods or services under a clearly
different mark. Trademarks which are used in interstate or foreign
commerce may be registered with the Patent and Trademark Office.
</p>
</div>
</div>
<div id="outline-container-orgeeef155" class="outline-3">
<h3 id="orgeeef155"><span class="section-number-3">9.3</span> Patent</h3>
<div class="outline-text-3" id="text-9-3">
<p>
A patent for an invention is the grant of a property right to the
inventor, issued by the Patent and Trademark Office. The term of a new
patent is 20 years from the date on which the application for the
patent was filed in the United States or, in special cases, from the
date an earlier related application was filed, subject to the payment
of maintenance fees. US patent grants are effective only within the
US, US territories, and US possessions.
</p>

<p>
The right conferred by the patent grant is, in the language of the
statute and of the grant itself, “the right to exclude others from
making, using, offering for sale, or selling” the invention in the
United States or “importing” the invention into the United States.
What is granted is not the right to make, use, offer for sale, sell or
import, but the right to exclude others from making, using, offering
for sale, selling or importing the invention.
</p>
</div>
</div>
<div id="outline-container-org5b6dab9" class="outline-3">
<h3 id="org5b6dab9"><span class="section-number-3">9.4</span> Labour Theory of Property</h3>
<div class="outline-text-3" id="text-9-4">
<p>
Locke argues that when a person “mixes” his or her labor with the
land, that person is entitled to the fruit of his or her labor. So if
a person tills and plants crops on a section of land that is not
already owned by another—an act which, Locke notes, requires
considerable toil—that person has a right to claim ownership of the
crops.
</p>
</div>
<div id="outline-container-org6ba325b" class="outline-4">
<h4 id="org6ba325b"><span class="section-number-4">9.4.1</span> Criticisms</h4>
<div class="outline-text-4" id="text-9-4-1">
<ol class="org-ol">
<li>Intellectual Property are nonexclusionary in nature, and are thus
not scarce</li>
<li>Property right is a natural right</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgbb2076d" class="outline-3">
<h3 id="orgbb2076d"><span class="section-number-3">9.5</span> Utilitarian Theory of Property</h3>
<div class="outline-text-3" id="text-9-5">
<p>
Property rights are better understood as artificial rights or
conventions devised by the state to achieve certain practical ends.
According to utilitarian theory, granting property rights will
maximize the good for the greatest number of people in a given
society. inventions. Incentives in the form of copyrights and patents
would motivate individuals to bring out their creative products and
that, as a result, American society in general would benefit.
</p>
</div>
</div>
<div id="outline-container-org6adc506" class="outline-3">
<h3 id="org6adc506"><span class="section-number-3">9.6</span> Personality Theory</h3>
<div class="outline-text-3" id="text-9-6">
<p>
According to the personality theory of property, the intellectual
object is an extension of the creator’s personality (i.e., the
person’s being, or soul). And it is because of this relationship
between the intellectua object and the creator’s personality that
advocates of the personality theory believe that creative works
deserve legal protection.
</p>
</div>
</div>
</div>
