org/reference/is1103.org
** ACM Code of Ethics
*** Principle 1: PUBLIC

Software engineers shall act consistently with the public interest. In
particular, software engineers shall, as appropriate:

1.01. Accept full responsibility for their own work.

1.02. Moderate the interests of the software engineer, the employer,
the client and the users with the public good.

1.03. Approve software only if they have a well-founded belief that it
is safe, meets specifications, passes appropriate tests, and does not
diminish quality of life, diminish privacy or harm the environment.
The ultimate effect of the work should be to the public good.

1.04. Disclose to appropriate persons or authorities any actual or
potential danger to the user, the public, or the environment, that
they reasonably believe to be associated with software or related
documents.

1.05. Cooperate in efforts to address matters of grave public concern
caused by software, its installation, maintenance, support or
documentation.

1.06. Be fair and avoid deception in all statements, particularly
public ones, concerning software or related documents, methods and
tools.

1.07. Consider issues of physical disabilities, allocation of
resources, economic disadvantage and other factors that can diminish
access to the benefits of software.

1.08. Be encouraged to volunteer professional skills to good causes
and contribute to public education concerning the discipline.

*** Principle 2: CLIENT AND EMPLOYER

Software engineers shall act in a manner that is in the best interests
of their client and employer, consistent with the public interest. In
particular, software engineers shall, as appropriate:

2.01. Provide service in their areas of competence, being honest and
forthright about any limitations of their experience and education.

2.02. Not knowingly use software that is obtained or retained either
illegally or unethically.

2.03. Use the property of a client or employer only in ways properly
authorized, and with the client's or employer's knowledge and consent.

2.04. Ensure that any document upon which they rely has been approved,
when required, by someone authorized to approve it.

2.05. Keep private any confidential information gained in their
professional work, where such confidentiality is consistent with the
public interest and consistent with the law.

2.06. Identify, document, collect evidence and report to the client or
the employer promptly if, in their opinion, a project is likely to
fail, to prove too expensive, to violate intellectual property law, or
otherwise to be problematic.

2.07. Identify, document, and report significant issues of social
concern, of which they are aware, in software or related documents, to
the employer or the client.

2.08. Accept no outside work detrimental to the work they perform for
their primary employer.

2.09. Promote no interest adverse to their employer or client, unless
a higher ethical concern is being compromised; in that case, inform
the employer or another appropriate authority of the ethical concern.

*** Principle 3: PRODUCT

Software engineers shall ensure that their products and related
modifications meet the highest professional standards possible. In
particular, software engineers shall, as appropriate:

3.01. Strive for high quality, acceptable cost and a reasonable
schedule, ensuring significant tradeoffs are clear to and accepted by
the employer and the client, and are available for consideration by
the user and the public.

3.02. Ensure proper and achievable goals and objectives for any
project on which they work or propose.

3.03. Identify, define and address ethical, economic, cultural, legal
and environmental issues related to work projects.

3.04. Ensure that they are qualified for any project on which they
work or propose to work by an appropriate combination of education and
training, and experience.

3.05. Ensure an appropriate method is used for any project on which
they work or propose to work.

3.06. Work to follow professional standards, when available, that are
most appropriate for the task at hand, departing from these only when
ethically or technically justified.

3.07. Strive to fully understand the specifications for software on
which they work.

3.08. Ensure that specifications for software on which they work have
been well documented, satisfy the users’ requirements and have the
appropriate approvals.

3.09. Ensure realistic quantitative estimates of cost, scheduling,
personnel, quality and outcomes on any project on which they work or
propose to work and provide an uncertainty assessment of these
estimates.

3.10. Ensure adequate testing, debugging, and review of software and
related documents on which they work.

3.11. Ensure adequate documentation, including significant problems
discovered and solutions adopted, for any project on which they work.

3.12. Work to develop software and related documents that respect the
privacy of those who will be affected by that software.

3.13. Be careful to use only accurate data derived by ethical and
lawful means, and use it only in ways properly authorized.

3.14. Maintain the integrity of data, being sensitive to outdated or
flawed occurrences.

3.15 Treat all forms of software maintenance with the same
professionalism as new development.

*** Principle 4: JUDGMENT

Software engineers shall maintain integrity and independence in their
professional judgment. In particular, software engineers shall, as
appropriate:

4.01. Temper all technical judgments by the need to support and
maintain human values.

4.02 Only endorse documents either prepared under their supervision or
within their areas of competence and with which they are in agreement.

4.03. Maintain professional objectivity with respect to any software
or related documents they are asked to evaluate.

4.04. Not engage in deceptive financial practices such as bribery,
double billing, or other improper financial practices.

4.05. Disclose to all concerned parties those conflicts of interest
that cannot reasonably be avoided or escaped.

4.06. Refuse to participate, as members or advisors, in a private,
governmental or professional body concerned with software related
issues, in which they, their employers or their clients have
undisclosed potential conflicts of interest.

