html/is1103.html

<div id="outline-container-orgf88c2f9" class="outline-2">
<h2 id="orgf88c2f9"><span class="section-number-2">10</span> Appendix</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org1d9de46" class="outline-3">
<h3 id="org1d9de46"><span class="section-number-3">10.1</span> ACM Code of Ethics</h3>
<div class="outline-text-3" id="text-10-1">
</div>
<div id="outline-container-org8c4f386" class="outline-4">
<h4 id="org8c4f386"><span class="section-number-4">10.1.1</span> Principle 1: PUBLIC</h4>
<div class="outline-text-4" id="text-10-1-1">
<p>
Software engineers shall act consistently with the public interest. In
particular, software engineers shall, as appropriate:
</p>

<p>
1.01. Accept full responsibility for their own work.
</p>

<p>
1.02. Moderate the interests of the software engineer, the employer,
the client and the users with the public good.
</p>

<p>
1.03. Approve software only if they have a well-founded belief that it
is safe, meets specifications, passes appropriate tests, and does not
diminish quality of life, diminish privacy or harm the environment.
The ultimate effect of the work should be to the public good.
</p>

<p>
1.04. Disclose to appropriate persons or authorities any actual or
potential danger to the user, the public, or the environment, that
they reasonably believe to be associated with software or related
documents.
</p>

<p>
1.05. Cooperate in efforts to address matters of grave public concern
caused by software, its installation, maintenance, support or
documentation.
</p>

<p>
1.06. Be fair and avoid deception in all statements, particularly
public ones, concerning software or related documents, methods and
tools.
</p>

<p>
1.07. Consider issues of physical disabilities, allocation of
resources, economic disadvantage and other factors that can diminish
access to the benefits of software.
</p>

<p>
1.08. Be encouraged to volunteer professional skills to good causes
and contribute to public education concerning the discipline.
</p>
</div>
</div>

<div id="outline-container-org7e38c86" class="outline-4">
<h4 id="org7e38c86"><span class="section-number-4">10.1.2</span> Principle 2: CLIENT AND EMPLOYER</h4>
<div class="outline-text-4" id="text-10-1-2">
<p>
Software engineers shall act in a manner that is in the best interests
of their client and employer, consistent with the public interest. In
particular, software engineers shall, as appropriate:
</p>

<p>
2.01. Provide service in their areas of competence, being honest and
forthright about any limitations of their experience and education.
</p>

<p>
2.02. Not knowingly use software that is obtained or retained either
illegally or unethically.
</p>

<p>
2.03. Use the property of a client or employer only in ways properly
authorized, and with the client's or employer's knowledge and consent.
</p>

<p>
2.04. Ensure that any document upon which they rely has been approved,
when required, by someone authorized to approve it.
</p>

<p>
2.05. Keep private any confidential information gained in their
professional work, where such confidentiality is consistent with the
public interest and consistent with the law.
</p>

<p>
2.06. Identify, document, collect evidence and report to the client or
the employer promptly if, in their opinion, a project is likely to
fail, to prove too expensive, to violate intellectual property law, or
otherwise to be problematic.
</p>

<p>
2.07. Identify, document, and report significant issues of social
concern, of which they are aware, in software or related documents, to
the employer or the client.
</p>

<p>
2.08. Accept no outside work detrimental to the work they perform for
their primary employer.
</p>

<p>
2.09. Promote no interest adverse to their employer or client, unless
a higher ethical concern is being compromised; in that case, inform
the employer or another appropriate authority of the ethical concern.
</p>
</div>
</div>

<div id="outline-container-org3260f11" class="outline-4">
<h4 id="org3260f11"><span class="section-number-4">10.1.3</span> Principle 3: PRODUCT</h4>
<div class="outline-text-4" id="text-10-1-3">
<p>
Software engineers shall ensure that their products and related
modifications meet the highest professional standards possible. In
particular, software engineers shall, as appropriate:
</p>

<p>
3.01. Strive for high quality, acceptable cost and a reasonable
schedule, ensuring significant tradeoffs are clear to and accepted by
the employer and the client, and are available for consideration by
the user and the public.
</p>

<p>
3.02. Ensure proper and achievable goals and objectives for any
project on which they work or propose.
</p>

<p>
3.03. Identify, define and address ethical, economic, cultural, legal
and environmental issues related to work projects.
</p>

<p>
3.04. Ensure that they are qualified for any project on which they
work or propose to work by an appropriate combination of education and
training, and experience.
</p>

<p>
3.05. Ensure an appropriate method is used for any project on which
they work or propose to work.
</p>

<p>
3.06. Work to follow professional standards, when available, that are
most appropriate for the task at hand, departing from these only when
ethically or technically justified.
</p>

<p>
3.07. Strive to fully understand the specifications for software on
which they work.
</p>

<p>
3.08. Ensure that specifications for software on which they work have
been well documented, satisfy the users’ requirements and have the
appropriate approvals.
</p>

<p>
3.09. Ensure realistic quantitative estimates of cost, scheduling,
personnel, quality and outcomes on any project on which they work or
propose to work and provide an uncertainty assessment of these
estimates.
</p>

<p>
3.10. Ensure adequate testing, debugging, and review of software and
related documents on which they work.
</p>

<p>
3.11. Ensure adequate documentation, including significant problems
discovered and solutions adopted, for any project on which they work.
</p>

<p>
3.12. Work to develop software and related documents that respect the
privacy of those who will be affected by that software.
</p>

<p>
3.13. Be careful to use only accurate data derived by ethical and
lawful means, and use it only in ways properly authorized.
</p>

<p>
3.14. Maintain the integrity of data, being sensitive to outdated or
flawed occurrences.
</p>

<p>
3.15 Treat all forms of software maintenance with the same
professionalism as new development.
</p>
</div>
</div>

<div id="outline-container-orgd21d56e" class="outline-4">
<h4 id="orgd21d56e"><span class="section-number-4">10.1.4</span> Principle 4: JUDGMENT</h4>
<div class="outline-text-4" id="text-10-1-4">
<p>
Software engineers shall maintain integrity and independence in their
professional judgment. In particular, software engineers shall, as
appropriate:
</p>

<p>
4.01. Temper all technical judgments by the need to support and
maintain human values.
</p>

<p>
4.02 Only endorse documents either prepared under their supervision or
within their areas of competence and with which they are in agreement.
</p>

<p>
4.03. Maintain professional objectivity with respect to any software
or related documents they are asked to evaluate.
</p>

<p>
4.04. Not engage in deceptive financial practices such as bribery,
double billing, or other improper financial practices.
</p>

<p>
4.05. Disclose to all concerned parties those conflicts of interest
that cannot reasonably be avoided or escaped.
</p>

<p>
4.06. Refuse to participate, as members or advisors, in a private,
governmental or professional body concerned with software related
issues, in which they, their employers or their clients have
undisclosed potential conflicts of interest.
</p>
</div>
</div>
