org/reference/is1103.org
*** Principle 5: MANAGEMENT

Software engineering managers and leaders shall subscribe to and
promote an ethical approach to the management of software development
and maintenance . In particular, those managing or leading software
engineers shall, as appropriate:

5.01 Ensure good management for any project on which they work,
including effective procedures for promotion of quality and reduction
of risk.

5.02. Ensure that software engineers are informed of standards before
being held to them.

5.03. Ensure that software engineers know the employer's policies and
procedures for protecting passwords, files and information that is
confidential to the employer or confidential to others.

5.04. Assign work only after taking into account appropriate
contributions of education and experience tempered with a desire to
further that education and experience.

5.05. Ensure realistic quantitative estimates of cost, scheduling,
personnel, quality and outcomes on any project on which they work or
propose to work, and provide an uncertainty assessment of these
estimates.

5.06. Attract potential software engineers only by full and accurate
description of the conditions of employment.

5.07. Offer fair and just remuneration.

5.08. Not unjustly prevent someone from taking a position for which
that person is suitably qualified.

5.09. Ensure that there is a fair agreement concerning ownership of
any software, processes, research, writing, or other intellectual
property to which a software engineer has contributed.

5.10. Provide for due process in hearing charges of violation of an
employer's policy or of this Code.

5.11. Not ask a software engineer to do anything inconsistent with
this Code.

5.12. Not punish anyone for expressing ethical concerns about a
project.

*** Principle 6: PROFESSION

Software engineers shall advance the integrity and reputation of the
profession consistent with the public interest. In particular,
software engineers shall, as appropriate:

6.01. Help develop an organizational environment favorable to acting
ethically.

6.02. Promote public knowledge of software engineering.

6.03. Extend software engineering knowledge by appropriate
participation in professional organizations, meetings and
publications.

6.04. Support, as members of a profession, other software engineers
striving to follow this Code.

6.05. Not promote their own interest at the expense of the profession,
client or employer.

6.06. Obey all laws governing their work, unless, in exceptional
circumstances, such compliance is inconsistent with the public
interest.

6.07. Be accurate in stating the characteristics of software on which
they work, avoiding not only false claims but also claims that might
reasonably be supposed to be speculative, vacuous, deceptive,
misleading, or doubtful.

6.08. Take responsibility for detecting, correcting, and reporting
errors in software and associated documents on which they work.

6.09. Ensure that clients, employers, and supervisors know of the
software engineer's commitment to this Code of ethics, and the
subsequent ramifications of such commitment.

6.10. Avoid associations with businesses and organizations which are
in conflict with this code.

6.11. Recognize that violations of this Code are inconsistent with
being a professional software engineer.

6.12. Express concerns to the people involved when significant
violations of this Code are detected unless this is impossible,
counter-productive, or dangerous.

6.13. Report significant violations of this Code to appropriate
authorities when it is clear that consultation with people involved in
these significant violations is impossible, counter-productive or
dangerous.

*** Principle 7: COLLEAGUES

Software engineers shall be fair to and supportive of their
colleagues. In particular, software engineers shall, as appropriate:

7.01. Encourage colleagues to adhere to this Code.

7.02. Assist colleagues in professional development.

7.03. Credit fully the work of others and refrain from taking undue
credit.

7.04. Review the work of others in an objective, candid, and
properly-documented way.

7.05. Give a fair hearing to the opinions, concerns, or complaints of
a colleague.

7.06. Assist colleagues in being fully aware of current standard work
practices including policies and procedures for protecting passwords,
files and other confidential information, and security measures in
general.

7.07. Not unfairly intervene in the career of any colleague; however,
concern for the employer, the client or public interest may compel
software engineers, in good faith, to question the competence of a
colleague.

7.08. In situations outside of their own areas of competence, call
upon the opinions of other professionals who have competence in that
area.

*** Principle 8: SELF

Software engineers shall participate in lifelong learning regarding
the practice of their profession and shall promote an ethical approach
to the practice of the profession. In particular, software engineers
shall continually endeavor to:

8.01. Further their knowledge of developments in the analysis,
specification, design, development, maintenance and testing of
software and related documents, together with the management of the
development process.

8.02. Improve their ability to create safe, reliable, and useful
quality software at reasonable cost and within a reasonable time.

8.03. Improve their ability to produce accurate, informative, and
well-written documentation.

8.04. Improve their understanding of the software and related
documents on which they work and of the environment in which they will
be used.

8.05. Improve their knowledge of relevant standards and the law
governing the software and related documents on which they work.

8.06 Improve their knowledge of this Code, its interpretation, and its
application to their work.

8.07 Not give unfair treatment to anyone because of any irrelevant
prejudices.

8.08. Not influence others to undertake any action that involves a
breach of this Code.

8.09. Recognize that personal violations of this Code are inconsistent
with being a professional software engineer.
